app/Controllers/Dashboard.php

    public function index()
    {
        $kamarModel      = new KamarModel();
        $penghuniModel   = new PenghuniModel();
        $cashflowModel   = new CashflowModel();
        $pemesananModel  = new PemesananModel();
        $tagihanModel    = new TagihanModel();

        // Tagihan belum lunas
        $tagihan_belum_lunas = $tagihanModel
            ->select('tbl_tagihan.*, tbl_penghuni.nama_lengkap, tbl_kamar.nomor_kamar')
            ->join('tbl_penghuni', 'tbl_penghuni.id_penghuni = tbl_tagihan.id_penghuni')
            ->join('tbl_kamar', 'tbl_kamar.id_kamar = tbl_penghuni.id_kamar')
            ->where('tbl_tagihan.status', 'belum_lunas')
            ->orderBy('tbl_tagihan.tahun', 'ASC')
            ->limit(5)
            ->findAll();

        // Kamar terisi = jumlah kamar unik yang dihuni oleh penghuni aktif
        $kamar_terisi = $penghuniModel
            ->where('status', 'aktif')
            ->selectCount('id_kamar', 'total')
            ->groupBy('id_kamar')
            ->get()
            ->getNumRows();

        $data = [
            'title'                     => 'Dashboard',
            'total_kamar'               => $kamarModel->countAll(),
            'kamar_tersedia'            => $kamarModel->where('status', 'tersedia')->countAllResults(false),
            'kamar_terisi'              => $kamar_terisi,
            'total_penghuni'            => $penghuniModel->where('status', 'aktif')->countAllResults(false),
            'total_pemasukan'           => $cashflowModel->where('tipe', 'pemasukan')->selectSum('jumlah')->get()->getRow()->jumlah ?? 0,
            'total_pengeluaran'         => $cashflowModel->where('tipe', 'pengeluaran')->selectSum('jumlah')->get()->getRow()->jumlah ?? 0,
            'total_pemesanan_baru'      => $pemesananModel->where('status', 'menunggu_dp')->countAllResults(false),
            'tagihan_terlambat'         => $tagihan_belum_lunas,
            'jumlah_tagihan_belum_lunas'=> count($tagihan_belum_lunas),
        ];
---
SELECT `tbl_tagihan`.*, `tbl_penghuni`.`nama_lengkap`, `tbl_kamar`.`nomor_kamar`
FROM `tbl_tagihan`
JOIN `tbl_penghuni` ON `tbl_penghuni`.`id_penghuni` = `tbl_tagihan`.`id_penghuni`
JOIN `tbl_kamar` ON `tbl_kamar`.`id_kamar` = `tbl_penghuni`.`id_kamar`
WHERE `tbl_tagihan`.`status` = 'belum_lunas'
ORDER BY `tbl_tagihan`.`tahun` ASC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `tbl_kamar`
WHERE `status` = 'tersedia'
AND `status` = 'terisi'
SELECT COUNT(`id_kamar`) AS `total`
FROM `tbl_penghuni`
WHERE `status` = 'aktif'
GROUP BY `id_kamar`
SELECT COUNT(*) AS `numrows`
FROM `tbl_penghuni`
WHERE `status` = 'aktif'
SELECT COUNT(*) AS `numrows`
FROM `tbl_pemesanan`
WHERE `status` = 'menunggu_dp'
SELECT SUM(`jumlah`) AS `jumlah`
FROM `tbl_cashflow`
WHERE `tipe` = 'pengeluaran'
SELECT COUNT(*) AS `numrows` FROM `tbl_kamar`
SELECT COUNT(*) AS `numrows`
FROM `tbl_kamar`
WHERE `status` = 'tersedia'
SELECT SUM(`jumlah`) AS `jumlah`
FROM `tbl_cashflow`
WHERE `tipe` = 'pemasukan'