app/Controllers/Home.php

SELECT *
FROM `tbl_kamar`
WHERE `status` = 'tersedia'
ORDER BY `tipe` DESC
 LIMIT 3
---
    public function index()
    {
        $kamarModel = new KamarModel();
        $data['kamarPopuler'] = $kamarModel->where('status', 'tersedia')
                                           ->orderBy('tipe', 'DESC')
                                           ->limit(3)
                                           ->findAll();