app/Controllers/Inventori.php

SELECT *
FROM `tbl_kamar`
---
    public function __construct()
    {
        $this->model      = new InventoriModel();
        $this->kamarModel = new KamarModel();

        $kamarOptions = ['' => 'Area Umum'];
        foreach ($this->kamarModel->findAll() as $k) {