app/Controllers/Penghuni.php

SELECT *
FROM `tbl_kamar`
---
    public function __construct()
    {
        $this->model      = new PenghuniModel();
        $this->kamarModel = new KamarModel();

        // Ambil daftar kamar untuk dropdown
        $kamarList = $this->kamarModel->findAll();