app/Controllers/PublicController.php

    public function katalog()
    {
        $kamarModel = new KamarModel();
        $data['kamar'] = $kamarModel->where('status', 'tersedia')->findAll();
---
SELECT *
FROM `tbl_kamar`
WHERE `status` = 'tersedia'

    public function pesan($id_kamar)
    {
        $kamarModel = new KamarModel();
        $kamar = $kamarModel->find($id_kamar);
---
SELECT *
FROM `tbl_kamar`
WHERE `tbl_kamar`.`id_kamar` = '2'