app/Controllers/Tagihan.php

SELECT *
FROM `tbl_penghuni`
---
    public function __construct()
    {
        $this->model          = new TagihanModel();
        $this->penghuniModel  = new PenghuniModel();

        $penghuniOptions = [];
        foreach ($this->penghuniModel->findAll() as $p) {