app/Models/PenghuniModel.php

    public function getPenghuniWithKamar()
    {
        return $this->select('tbl_penghuni.*, tbl_kamar.nomor_kamar')
                    ->join('tbl_kamar', 'tbl_kamar.id_kamar = tbl_penghuni.id_kamar')
                    ->orderBy('tbl_penghuni.id_penghuni', 'DESC')
                    ->findAll();
---
SELECT `tbl_penghuni`.*, `tbl_kamar`.`nomor_kamar`
FROM `tbl_penghuni`
JOIN `tbl_kamar` ON `tbl_kamar`.`id_kamar` = `tbl_penghuni`.`id_kamar`
ORDER BY `tbl_penghuni`.`id_penghuni` DESC