app/Views/public/katalog.php

                        <!-- Rating -->
                        <?php
                        $db = \Config\Database::connect();
                        $avg = $db->table('tbl_review')->where('id_kamar', $k['id_kamar'])->selectAvg('rating')->get()->getRow()->rating ?? 0;
                        $count = $db->table('tbl_review')->where('id_kamar', $k['id_kamar'])->countAllResults();
---
SELECT AVG(`rating`) AS `rating`
FROM `tbl_review`
WHERE `id_kamar` = '2'
SELECT COUNT(*) AS `numrows`
FROM `tbl_review`
WHERE `id_kamar` = '2'